app/views/users/index.html.erb

SELECT  `donations`.* FROM `donations` WHERE `donations`.`user_id` = 1  ORDER BY `donations`.`id` ASC LIMIT 1
---
      </tr>
      <% user.donations.each do |donation| %>