LipstickProject/app/controllers/users_controller.rb

INSERT INTO `addresses` (`street`, `house`, `postal_code`, `city`, `province`, `user_id`, `created_at`, `updated_at`) VALUES ('Street', 'Number', 'Postco', 'Vancouver', 'Bc', 1, '2015-07-26 03:54:26', '2015-07-26 03:54:26')
INSERT INTO `donations` (`amount`, `user_id`, `created_at`, `updated_at`) VALUES (50, 1, '2015-07-26 03:54:26', '2015-07-26 03:54:26')
INSERT INTO `users` (`first_name`, `last_name`, `email`, `accepts_marketing`, `recurring`) VALUES ('Magg', 'Moss', 'magg@test.com', 0, 0)
---
  def create
    address = Address.new(user_params[:addresses])
    donation = Donation.new(user_params[:donations])

    @user = User.new(user_params.except(:addresses, :donations))
    @user.addresses << address