app/controllers/users_controller.rb

  def create
    address = Address.new(user_params[:addresses])
    donation = Donation.new(user_params[:donations])

    @user = User.new(user_params.except(:addresses, :donations))
    @user.addresses << address
---
INSERT INTO `addresses` (`street`, `house`, `postal_code`, `city`, `province`, `user_id`, `created_at`, `updated_at`) VALUES ('3020 QUEBEC ST', '', 'V5T3B1', 'VANCOUVER', 'British Columbia', 6, '2015-07-26 00:52:35', '2015-07-26 00:52:35')
INSERT INTO `donations` (`amount`, `user_id`, `created_at`, `updated_at`) VALUES (140, 6, '2015-07-26 00:52:35', '2015-07-26 00:52:35')
INSERT INTO `users` (`first_name`, `last_name`, `email`, `accepts_marketing`, `recurring`) VALUES ('i', 'i', 'isha.kumaarr@gmail.com', 0, 0)